
&НаСервере
Процедура СоздатьОбновитьПоказателиНаСервере()
	обк = РеквизитФормыВЗначение("Объект");
	обк.СоздатьОбновитьПоказатели();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбновитьПоказатели(Команда)
	СоздатьОбновитьПоказателиНаСервере();
КонецПроцедуры

&НаСервере
Процедура RUN_TESTНаСервере()
	
	РеквизитФормыВЗначение("Объект")
		.СоздатьОбновитьПоказатели(true,true);	// Вставить содержимое обработчика.
		
	ДатаКолонки3 = '20241231';
	ДатаКолонки4 = '20250831';
	Организация = Справочники.Организации.НайтиПоКоду("00-000001");
	РеквизитФормыВЗначение("Объект")
		.ТестироватьВсеПоказатели(ДатаКолонки3 ,ДатаКолонки4, Организация, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура RUN_TEST(Команда)
	RUN_TESTНаСервере();
КонецПроцедуры
