
#Область ВЫЧИСЛЕНИЕ_Показателей

// Универсальный метод вычисления показателя в зависимости от номера строки и колонки
Функция ВычислитьПоказатель(НомерСтроки, НомерКолонки, пНачалоПериода, пКонецПериода, пСтруктураПараметров, Знач пВыводитьСообщения = Ложь) Экспорт
	              
	мНачалоПериода = пНачалоПериода;
	мКонецПериода = пКонецПериода;
	мСтруктураПараметров = пСтруктураПараметров;
	мВыводитьСообщения = пВыводитьСообщения;
	Выражение = "ВычислитьПоказатель_стр"+Формат(НомерСтроки,"ЧГ=;ЧРГ=")+"кол"+Формат(НомерКолонки,"ЧГ=;ЧРГ=")+"()";
	сообщить(Выражение);
	Выполнить(Выражение);
	
	Возврат мЗначениеПоказателя;

КонецФункции

//////////  ПРЕДЫДУЩИЙ ПЕРИОД

//////////  СТРОКА 2

// эта функция - только для теста на типовой бухгалтерии (не НФО)
Функция ВычислитьПоказатель_стр2кол3_тест()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(2,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр2кол3()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(2,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр2кол4()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(2,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр2кол6()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(2,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр2кол7()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(2,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 3

Функция ВычислитьПоказатель_стр3кол3()
	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(3,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр3кол4()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(3,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр3кол6()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(3,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр3кол7()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(3,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);		мЗначениеПоказателя = ЗначениеПоказателя;
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 5

Функция ВычислитьПоказатель_стр5кол3()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(5,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр5кол4()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(5,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр5кол6()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(5,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр5кол7()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(5,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 10

Функция ВычислитьПоказатель_стр10кол3()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(10,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр10кол4()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(10,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр10кол6()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(10,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр10кол7()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(10,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 11

Функция ВычислитьПоказатель_стр11кол3()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(11,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр11кол4()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(11,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр11кол6()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(11,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр11кол7()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(11,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 13

Функция ВычислитьПоказатель_стр13кол3()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(13,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр13кол4()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(13,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр13кол6()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(13,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр13кол7()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода=НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = КонецПредыдущегоПериода();
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(13,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 25

Функция ВычислитьПоказатель_стр25кол3()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(25,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр25кол4()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(25,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр25кол6()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(25,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр25кол7()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(25,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 26

Функция ВычислитьПоказатель_стр26кол3()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(26,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр26кол4()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(26,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр26кол6()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(26,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр26кол7()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(26,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

/////////////////////////////////  ТЕКУЩИЙ ПЕРИОД

//////////  СТРОКА 29

Функция ВычислитьПоказатель_стр29кол3()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(29,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр29кол4()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(29,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр29кол6()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(29,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр29кол7()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(29,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 30

Функция ВычислитьПоказатель_стр30кол3()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(30,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр30кол4()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(30,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр30кол6()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(30,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр30кол7()

	ЭтоОстатокНаНачало = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(30,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 32

Функция ВычислитьПоказатель_стр32кол3()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(32,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр32кол4()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(32,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр32кол6()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(32,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр32кол7()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(32,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 37

Функция ВычислитьПоказатель_стр37кол3()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(37,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр37кол4()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(37,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр37кол6()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(37,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр37кол7()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(37,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 38

Функция ВычислитьПоказатель_стр38кол3()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(38,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр38кол4()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(38,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр38кол6()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(38,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр38кол7()
	
	ЭтоДебетовыйОборот = Истина;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(38,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 40

Функция ВычислитьПоказатель_стр40кол3()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(40,3,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр40кол4()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(40,4,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр40кол6()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(40,6,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр40кол7()
	
	ЭтоДебетовыйОборот = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	_НачалоПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	_КонецПериода = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено; //массив
	ЗначениеПоказателя = ОборотыПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка,_НачалоПериода, _КонецПериода, ЭтоДебетовыйОборот);
	ЛогВычисления_Обороты(40,7,ЭтоДебетовыйОборот,СчетСсылка,_НачалоПериода,_КонецПериода,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 52

Функция ВычислитьПоказатель_стр52кол3()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(52,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр52кол4()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(52,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр52кол6()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(52,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр52кол7()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(52,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

//////////  СТРОКА 53

Функция ВычислитьПоказатель_стр53кол3()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Сооружения(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(53,3,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр53кол4()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_ОфисноеОборудование(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(53,4,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр53кол6()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = ГруппаОС_Другие(); //массив
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(53,6,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

Функция ВычислитьПоказатель_стр53кол7()

	ЭтоОстатокНаНачало = Ложь;
	СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
	ДатаОстатка = НачалоГода(НачалоГода(мНачалоПериода)-1);
	СубконтоСсылка = Неопределено;
	ЗначениеПоказателя = ОстатокПоСчету(мСтруктураПараметров.Организация, СчетСсылка, СубконтоСсылка, ДатаОстатка, ЭтоОстатокНаНачало);
	ЛогВычисления_Остатки(53,7,ЭтоОстатокНаНачало,СчетСсылка,ДатаОстатка,мСтруктураПараметров,СубконтоСсылка,ЗначениеПоказателя);
	мЗначениеПоказателя = ЗначениеПоказателя;
	Возврат ЗначениеПоказателя;

КонецФункции

#КонецОбласти

#Область АналитикаОстатковИОборотов

Функция ПолучитьМассивСубконто(Ссылка) Экспорт

	запрос=новый запрос("Выбрать ссылка из справочник.БанковскиеСчета где Ссылка = &Ссылка");
	запрос.установитьпараметр("Ссылка",Ссылка);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	ТЗ=Рез.выгрузить();
	массивСсылок=ТЗ.ВыгрузитьКолонку("Ссылка");
	Возврат массивСсылок;

КонецФункции

Функция ГруппаОС_Сооружения() Экспорт
	возврат  ПолучитьМассивСубконто(Справочники.БанковскиеСчета.НайтиПоНаименованию("Сооружения", Истина));
КонецФункции

Функция ГруппаОС_ОфисноеОборудование() Экспорт
	возврат  ПолучитьМассивСубконто(справочнии.БанковскиеСчета.НайтиПоНаименованию("ОфисноеОборудование", Истина));
КонецФункции

Функция ГруппаОС_Другие() Экспорт
	возврат  ПолучитьМассивСубконто(Справочники.БанковскиеСчета.НайтиПоНаименованию("ДругиеВидыОсновныхСредств", Истина));
КонецФункции

#КонецОбласти

