&НаСервере
Процедура грв_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	флаг = ЭтаФорма.Параметры.Свойство("ВыполнитьВыгрузку");
	Если флаг = Истина Тогда
		ЭтаФорма.Новости.Вставить("ВыполнитьВыгрузку", Истина);
		ЭтаФорма.Новости.Вставить("ПутьККаталогуВыгрузки", Параметры.ПутьККаталогуВыгрузки);
		ЭтаФорма.Новости.Вставить("ПутьКФайлуВыгрузки", Параметры.ПутьКФайлуВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура грв_ПриОткрытииПосле(Отказ)
	
	флаг = ЭтаФорма.Новости.Свойство("ВыполнитьВыгрузку");
	
	Если флаг = Истина Тогда
		СформироватьОтчет(Неопределено);
		
		ПараметрыОтчета = грв_ВыгрузитьОтчет();
		
		Если ПараметрыОтчета = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПутьКФайлуВыгрузки = "";
		ЭтаФорма.Новости.Свойство("ПутьКФайлуВыгрузки",ПутьКФайлуВыгрузки);
		
		ПараметрыОтчета.Результат.Записать(ПутьКФайлуВыгрузки
			,ТипФайлаТабличногоДокумента.XLSX);
		
		Закрыть(ПараметрыОтчета);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция грв_ВыгрузитьОтчет()
	
	Если Элементы.Результат.ОтображениеСостояния.Видимость Тогда
		
		ТекущийЭлемент = Элементы.Сформировать;
		ПоказатьПредупреждение( , НСтр("ru = 'Нажмите ""Сформировать"" для получения отчета'"),
								, НСтр("ru = 'Отчет не сформирован'"));
		Возврат Неопределено;
		
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Результат",     Результат);
	ПараметрыОтчета.Вставить("Организация",   Отчет.Организация);
	ПараметрыОтчета.Вставить("ВключатьОбособленныеПодразделения", Отчет.ВключатьОбособленныеПодразделения);
	ПараметрыОтчета.Вставить("НачалоПериода", Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода",  Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("Счет",          Отчет.Счет);
	ПараметрыОтчета.Вставить("РучнаяКорректировка", РучнаяКорректировка);
		
	Возврат ПараметрыОтчета;
	
КонецФункции
